#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_account.wallet must be replaced
-/+ resource "azurerm_cosmosdb_account" "wallet" {
      ~ automatic_failover_enabled                   = false -> (known after apply)
      ~ connection_strings                           = (sensitive value)
      ~ create_mode                                  = "Default" -> (known after apply)
      ~ default_identity_type                        = "UserAssignedIdentity=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/io-p-itn-wallet-cosmos-id-01" -> "FirstPartyIdentity"
      ~ enable_automatic_failover                    = false -> (known after apply)
      ~ enable_free_tier                             = false -> (known after apply)
      ~ enable_multiple_write_locations              = false -> (known after apply)
      ~ endpoint                                     = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/" -> (known after apply)
      ~ free_tier_enabled                            = false -> (known after apply)
      ~ id                                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01" -> (known after apply)
      - key_vault_key_id                             = "https://io-p-itn-wallet-kv-01.vault.azure.net/keys/io-p-itn-wallet-cosno-key-01" -> null # forces replacement
      ~ minimal_tls_version                          = "Tls12" -> (known after apply)
      + mongo_server_version                         = (known after apply)
      ~ multiple_write_locations_enabled             = false -> (known after apply)
        name                                         = "io-p-itn-wallet-cosno-01"
      - network_acl_bypass_ids                       = [] -> null
      ~ primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      ~ primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      ~ primary_readonly_sql_connection_string       = (sensitive value)
      ~ primary_sql_connection_string                = (sensitive value)
      ~ read_endpoints                               = [
          - "https://io-p-itn-wallet-cosno-01-italynorth.documents.azure.com:443/",
          - "https://io-p-itn-wallet-cosno-01-germanywestcentral.documents.azure.com:443/",
        ] -> (known after apply)
      ~ secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      ~ secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      ~ secondary_readonly_sql_connection_string     = (sensitive value)
      ~ secondary_sql_connection_string              = (sensitive value)
        tags                                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      ~ write_endpoints                              = [
          - "https://io-p-itn-wallet-cosno-01-italynorth.documents.azure.com:443/",
        ] -> (known after apply)
        # (11 unchanged attributes hidden)

      - analytical_storage {
          - schema_type = "WellDefined" -> null
        }

      ~ backup {
          ~ interval_in_minutes = 0 -> (known after apply)
          ~ retention_in_hours  = 0 -> (known after apply)
          + storage_redundancy  = (known after apply)
          ~ tier                = "Continuous30Days" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ consistency_policy {
          - max_interval_in_seconds = 5 -> null
          - max_staleness_prefix    = 100 -> null
            # (1 unchanged attribute hidden)
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "io-p-itn-wallet-cosno-01-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "io-p-itn-wallet-cosno-01-germanywestcentral" -> null
          - location          = "germanywestcentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "germanywestcentral"
          + zone_redundant    = false
        }

      - identity {
          - identity_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/io-p-itn-wallet-cosmos-id-01",
            ] -> null
          - type         = "UserAssigned" -> null
        }
    }

  # module.cosmos.azurerm_private_endpoint.sql must be replaced
-/+ resource "azurerm_private_endpoint" "sql" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-sql-pep-01" -> (known after apply)
        name                     = "io-p-itn-wallet-sql-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-wallet-sql-pep-01.nic.2ab3f75e-6e33-49de-bb7b-077524002912"
              - name = "io-p-itn-wallet-sql-pep-01.nic.2ab3f75e-6e33-49de-bb7b-077524002912"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-sql-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.documents.azure.com"
              - name                = "privatelink.documents.azure.com"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-wallet-cosno-01.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.5",
                        ]
                      - name         = "io-p-itn-wallet-cosno-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-itn-wallet-cosno-01-italynorth.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.6",
                        ]
                      - name         = "io-p-itn-wallet-cosno-01-italynorth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-itn-wallet-cosno-01-germanywestcentral.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.7",
                        ]
                      - name         = "io-p-itn-wallet-cosno-01-germanywestcentral"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-sql-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-wallet-sql-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.5" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cosmos.azurerm_role_assignment.key_vault will be destroyed
  # (because azurerm_role_assignment.key_vault is not in configuration)
  - resource "azurerm_role_assignment" "key_vault" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/providers/Microsoft.Authorization/roleAssignments/eedbc3a9-3405-a9e7-4a5d-56e0ad6d4531" -> null
      - name                 = "eedbc3a9-3405-a9e7-4a5d-56e0ad6d4531" -> null
      - principal_id         = "a275ce6b-c47d-4d6f-b84b-4c619ba2e6a5" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/e147488a-f6f5-4113-8e2d-b22465e65bf6" -> null
      - role_definition_name = "Key Vault Crypto Service Encryption User" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01" -> null
    }

  # module.cosmos.azurerm_user_assigned_identity.cosmos will be destroyed
  # (because azurerm_user_assigned_identity.cosmos is not in configuration)
  - resource "azurerm_user_assigned_identity" "cosmos" {
      - client_id           = "b7a69b84-3917-4243-8e6e-f9772eb62eca" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/io-p-itn-wallet-cosmos-id-01" -> null
      - location            = "italynorth" -> null
      - name                = "io-p-itn-wallet-cosmos-id-01" -> null
      - principal_id        = "a275ce6b-c47d-4d6f-b84b-4c619ba2e6a5" -> null
      - resource_group_name = "io-p-itn-wallet-rg-01" -> null
      - tags                = {} -> null
      - tenant_id           = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
    }

  # module.iam.azurerm_cosmosdb_sql_role_assignment.func_app_user_to_cosmos_data_reader_db["db"] must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "func_app_user_to_cosmos_data_reader_db" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleAssignments/beb637f0-f49a-3e68-f71b-d7511eb39647" -> (known after apply)
      ~ name                = "beb637f0-f49a-3e68-f71b-d7511eb39647" -> (known after apply)
      ~ role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> (known after apply)
      ~ scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.iam.azurerm_role_assignment.func_app_user_to_kv_secrets will be created
  + resource "azurerm_role_assignment" "func_app_user_to_kv_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0bf4b41f-b797-4fe5-abf9-26b20977bd29"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "AllowDevelopmentEnvironment"                       = "false"
          - "AndroidBundleIdentifier"                           = "it.pagopa.app.io"
          - "AndroidCrlUrl"                                     = "https://android.googleapis.com/attestation/status"
          - "AndroidPlayIntegrityUrl"                           = "https://www.googleapis.com/auth/playintegrity"
          - "AndroidPlayStoreCertificateHash"                   = "feT-Pqrgg__NiwcDAehlAtPx6tHdZqwUK618VEdVT4I"
          - "AppleRootCertificate"                              = <<-EOT
                -----BEGIN CERTIFICATE-----
                MIICITCCAaegAwIBAgIQC/O+DvHN0uD7jG5yH2IXmDAKBggqhkjOPQQDAzBSMSYwJAYDVQQDDB1BcHBsZSBBcHAgQXR0ZXN0YXRpb24gUm9vdCBDQTETMBEGA1UECgwKQXBwbGUgSW5jLjETMBEGA1UECAwKQ2FsaWZvcm5pYTAeFw0yMDAzMTgxODMyNTNaFw00NTAzMTUwMDAwMDBaMFIxJjAkBgNVBAMMHUFwcGxlIEFwcCBBdHRlc3RhdGlvbiBSb290IENBMRMwEQYDVQQKDApBcHBsZSBJbmMuMRMwEQYDVQQIDApDYWxpZm9ybmlhMHYwEAYHKoZIzj0CAQYFK4EEACIDYgAERTHhmLW07ATaFQIEVwTtT4dyctdhNbJhFs/Ii2FdCgAHGbpphY3+d8qjuDngIN3WVhQUBHAoMeQ/cLiP1sOUtgjqK9auYen1mMEvRq9Sk3Jm5X8U62H+xTD3FE9TgS41o0IwQDAPBgNVHRMBAf8EBTADAQH/MB0GA1UdDgQWBBSskRBTM72+aEH/pwyp5frq5eWKoTAOBgNVHQ8BAf8EBAMCAQYwCgYIKoZIzj0EAwMDaAAwZQIwQgFGnByvsiVbpTKwSga0kP0e8EeDS4+sQmTvb7vn53O5+FRXgeLhpJ06ysC5PrOyAjEAp5U4xDgEgllF7En3VcE3iexZZtKeYnpqtijVoyFraWVIyd/dganmrduC1bmTBGwD
                -----END CERTIFICATE-----
            EOT
          - "CosmosDbConnectionString"                          = (sensitive value)
          - "CosmosDbDatabaseName"                              = "db"
          - "EntityConfigurationStorageAccountConnectionString" = "\"DefaultEndpointsProtocol=https;AccountName=scirulli;AccountKey=eDaKGRCEL+w1UqWoOa2ZmKBa1HXB6+UCq3Uwst+lT7d1pxj1X2SGnHOBLSmYHqcYKJ9fvVZnJMMJ+AStppZ/Zw==;EndpointSuffix=core.windows.net\""
          - "EntityConfigurationStorageContainerName"           = "cached"
          - "FETCH_KEEPALIVE_ENABLED"                           = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"               = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                  = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                       = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                 = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                           = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                    = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                          = "node"
          - "FederationEntityBasePath"                          = "https://wallet.io.pagopa.it"
          - "FederationEntityHomepageUri"                       = "https://io.italia.it"
          - "FederationEntityLogoUri"                           = "https://io.italia.it/assets/img/io-it-logo-blue.svg"
          - "FederationEntityOrganizationName"                  = "PagoPa S.p.A."
          - "FederationEntityPolicyUri"                         = "https://io.italia.it/privacy-policy/"
          - "FederationEntityTosUri"                            = "https://io.italia.it/privacy-policy/"
          - "FederationEntityTrustAnchorUri"                    = "https://demo.federation.eudi.wallet.developers.italia.it"
          - "GoogleAppCredentialsEncoded"                       = "foo"
          - "GooglePublicKey"                                   = <<-EOT
                -----BEGIN PUBLIC KEY-----
                MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAr7bHgiuxpwHsK7Qui8xU
                FmOr75gvMsd/dTEDDJdSSxtf6An7xyqpRR90PL2abxM1dEqlXnf2tqw1Ne4Xwl5j
                lRfdnJLmN0pTy/4lj4/7tv0Sk3iiKkypnEUtR6WfMgH0QZfKHM1+di+y9TFRtv6y
                //0rb+T+W8a9nsNL/ggjnar86461qO0rOs2cXjp3kOG1FEJ5MVmFmBGtnrKpa73X
                pXyTqRxB/M0n1n/W9nGqC4FSYa04T6N5RIZGBN2z2MT5IKGbFlbC8UrW0DxW7AYI
                mQQcHtGl/m00QLVWutHQoVJYnFPlXTcHYvASLu+RhhsbDmxMgJJ0mcDpvsC4PjvB
                +TxywElgS70vE0XmLD+OJtvsBslHZvPBKCOdT0MS+tgSOIfga+z1Z1g7+DVagf7q
                uvmag8jfPioyKvxnK/EgsTUVi2ghzq8wm27ud/mIM7AY2qEORR8Go3TVB4HzWQgp
                Zrt3i5MIlCaY504LzSRiigHCzAPlHws+W0rB5N+er5/2pJKnfBSDiCiFAVtCLOZ7
                gLiMm0jhO2B6tUXHI/+MRPjy02i59lINMRRev56GKtcd9qO/0kUJWdZTdA2XoS82
                ixPvZtXQpUpuL12ab+9EaDK8Z4RHJYYfCT3Q5vNAXaiWQ+8PTWm2QgBR/bkwSWc+
                NpUFgNPN9PvQi8WEg5UmAGMCAwEAAQ==
                -----END PUBLIC KEY-----
            EOT
          - "IosBundleIdentifier"                               = "it.pagopa.app.io"
          - "IosTeamIdentifier"                                 = "DSEVY6MV9G"
          - "NODE_ENV"                                          = "production"
          - "PdvTokenizerApiBaseURL"                            = "https://api.uat.tokenizer.pdv.pagopa.it"
          - "PdvTokenizerApiKey"                                = "foo"
          - "PdvTokenizerTestUUID"                              = "c13b2aec-1597-4abd-a735-aacf2f935c93"
          - "SLOT_TASK_HUBNAME"                                 = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"   = "1"
          - "WEBSITE_DNS_SERVER"                                = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                          = "1"
          - "WalletKeys"                                        = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=WalletKeys)"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-01"
        name                                           = "io-p-itn-wallet-user-func-01"
      - storage_account_access_key                     = (sensitive value) -> null
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
